ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/HSM/f29h85x_hsm_aes_p_regs.xml
<module id="HSM_AES_P" HW_revision="" description="HSM AES P Registers">
	<register id="P_KEY2_6" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY2_7" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY2_4" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY2_5" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY2_2" width="32" page="0" offset="16" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY2_3" width="32" page="0" offset="20" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY2_0" width="32" page="0" offset="24" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY2_1" width="32" page="0" offset="28" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY1_6" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY1_7" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY1_4" width="32" page="0" offset="40" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY1_5" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY1_2" width="32" page="0" offset="48" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY1_3" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY1_0" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_KEY1_1" width="32" page="0" offset="60" internal="0" description="">
		<bitfield id="KEY" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_IV_IN_0" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_IV_IN_1" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_IV_IN_2" width="32" page="0" offset="72" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_IV_IN_3" width="32" page="0" offset="76" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_CTRL" width="32" page="0" offset="80" internal="0" description="">
		<bitfield id="OUTPUT_READY" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INPUT_READY" description="" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="DIRECTION" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="KEY_SIZE" description="" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="MODE" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CTR" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CTR_WIDTH" description="" begin="8" end="7" width="2" rwaccess="RW"/>
		<bitfield id="ICM" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CFB" description="" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="XTS" description="" begin="12" end="11" width="2" rwaccess="RW"/>
		<bitfield id="F8" description="" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="F9" description="" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CBCMAC" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GCM" description="" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="CCM" description="" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CCM_L" description="" begin="21" end="19" width="3" rwaccess="RW"/>
		<bitfield id="CCM_M" description="" begin="24" end="22" width="3" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="28" end="25" width="4" rwaccess="R"/>
		<bitfield id="SAVE_CONTEXT" description="" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SAVE_CONTEXT_READY" description="" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="CONTEXT_READY" description="" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="P_C_LENGTH_0" width="32" page="0" offset="84" internal="0" description="">
		<bitfield id="LENGTH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_C_LENGTH_1" width="32" page="0" offset="88" internal="0" description="">
		<bitfield id="LENGTH" description="" begin="28" end="0" width="29" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="31" end="29" width="3" rwaccess="R"/>
	</register>
	<register id="P_AUTH_LENGTH" width="32" page="0" offset="92" internal="0" description="">
		<bitfield id="AUTH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_DATA_IN_OUT_0" width="32" page="0" offset="96" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_DATA_IN_OUT_1" width="32" page="0" offset="100" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_DATA_IN_OUT_2" width="32" page="0" offset="104" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_DATA_IN_OUT_3" width="32" page="0" offset="108" internal="0" description="">
		<bitfield id="DATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="P_TAG_OUT_0" width="32" page="0" offset="112" internal="0" description="">
		<bitfield id="HASH" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="P_TAG_OUT_1" width="32" page="0" offset="116" internal="0" description="">
		<bitfield id="HASH" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="P_TAG_OUT_2" width="32" page="0" offset="120" internal="0" description="">
		<bitfield id="HASH" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="P_TAG_OUT_3" width="32" page="0" offset="124" internal="0" description="">
		<bitfield id="HASH" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="P_REVISION" width="32" page="0" offset="128" internal="0" description="">
		<bitfield id="Y_MINOR" description="" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="X_MAJOR" description="" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="R_RTL" description="" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="FUNC" description="" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="RESERVED" description="" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="SCHEME" description="" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="P_SYSCONFIG" width="32" page="0" offset="132" internal="0" description="">
		<bitfield id="DMA_REQ_DATA_IN_EN" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_DATA_OUT_EN" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_CONTEXT_IN_EN" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_CONTEXT_OUT_EN" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MAP_CONTEXT_OUT_ON_DATA_OUT" description="" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="31" end="10" width="22" rwaccess="R"/>
	</register>
	<register id="P_SYSSTATUS" width="32" page="0" offset="136" internal="0" description="">
		<bitfield id="RESETDONE" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RESERVED" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="P_IRQSTATUS" width="32" page="0" offset="140" internal="0" description="">
		<bitfield id="CONTEXT_IN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DATA_IN" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DATA_OUT" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CONTEXT_OUT" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="31" end="4" width="28" rwaccess="R"/>
	</register>
	<register id="P_IRQENABLE" width="32" page="0" offset="144" internal="0" description="">
		<bitfield id="CONTEXT_IN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DATA_IN" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DATA_OUT" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CONTEXT_OUT" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED" description="" begin="31" end="4" width="28" rwaccess="R"/>
	</register>
</module>
